Revit 2026 API

# IExporterIFCExportIFC Method

---

The method that Revit will invoke to perform an export to IFC.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
void ExportIFC(
	Document document,
	ExporterIFC exporter,
	View filterView
)
```
```vb
Sub ExportIFC (
	document As Document,
	exporter As ExporterIFC,
	filterView As View
)
```
```cpp
void ExportIFC(
	Document^ document,
	ExporterIFC^ exporter,
	View^ filterView
)
```
```fsharp
abstract ExportIFC :
        document : Document *
        exporter : ExporterIFC *
        filterView : View -> unit
```

#### Parameters

document Document
     The document to export.
exporter ExporterIFC
     The IFC exporter object.
filterView View
     The view whose filter visibility settings govern the export.

There will be a transaction group opened for the document. Any changes made to the document must be temporary, as the transaction group will automatically be rolled back at the end.

#### Reference

IExporterIFC Interface

Autodesk.Revit.DB.IFC Namespace